Revit 2024 API
ElectricalAnalyticalNode.TotalLoad Property
 The Total Connected Load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double TotalLoad { get; }
Visual Basic
Public ReadOnly Property TotalLoad As Double
	Get
Visual C++
public:
property double TotalLoad {
	double get ();
}
See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace